# [Datenverarbeitung] Umbenennungen

In [1]:
import pandas as pd
umsatz = pd.read_csv("datengrundlage.csv")

In [2]:
umsatz.head(3)

,Nr,Datum,Jahr,Land,Stadt,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
0,1,1/1/2025,2025,Südkorea,Seoul,5534.55,4427.64,NaN,Bereich-5,prd-3,6-43647-1,C-85
1,2,1/2/2025,2025,Südkorea,Seoul,6284.70,7164.56,NaN,Bereich-5,prd-1,2-43647-1,C-107
2,3,1/3/2025,2025,Vereinigtes Königreich,London,5437.65,6198.92,NaN,Bereich-1,prd-56,7-43647-1,C-141

## Umbenennungen

### rename

In [6]:
umsatz = umsatz.rename(columns = {"Land":"Länder", "Stadt":"Städte"})

In [8]:
# umsatz

### rename_axis

In [11]:
umsatz.rename_axis("ID", axis="columns")

ID,Nr,Datum,Jahr,Länder,Städte,Umsatz,Kosten,Rücksendung,Bereich,Produktgruppe,Logistik-Code,Kunde
0,1,1/1/2025,2025,Südkorea,Seoul,5534.55,4427.64,NaN,Bereich-5,prd-3,6-43647-1,C-85
1,2,1/2/2025,2025,Südkorea,Seoul,6284.70,7164.56,NaN,Bereich-5,prd-1,2-43647-1,C-107
2,3,1/3/2025,2025,Vereinigtes Königreich,London,5437.65,6198.92,NaN,Bereich-1,prd-56,7-43647-1,C-141
3,4,1/4/2025,2025,China,Peking,8587.20,5152.32,NaN,Bereich-2,prd-92,4-43647-1,C-124
4,5,1/5/2025,2025,USA,Los Angeles,9439.05,10382.95,NaN,Bereich-2,prd-85,1-43647-1,C-76
...,...,...,...,...,...,...,...,...,...,...,...,...
1375,1376,10/7/2028,2028,Südkorea,Yangsan-si,6019.05,4815.24,NaN,Bereich-3,prd-77,6-43663-1,C-85
1376,1377,10/8/2028,2028,Südkorea,Yangsan-si,6482.40,5185.92,NaN,Bereich-2,prd-96,5-43655-1,C-65
1377,1378,10/9/2028,2028,Deutschland,Stuttgart,9192.15,7353.72,NaN,Bereich-1,prd-50,3-43673-1,C-65
1378,1379,10/10/2028,2028,Mexiko,Torreón,9808.95,7847.16,1.0,Bereich-3,prd-72,8-43659-1,C-109
1379,1380,10/11/2028,2028,USA,Sacramento,8303.55,6642.84,NaN,Bereich-2,prd-88,1-43654-2,C-76

### rename(index=["old":"new"])

In [15]:
data = pd.DataFrame(data = {"airbus" : [59, 5.2, 101, 134267], 
                    "boeing" : [66, -3.5, 114, 156000]}, 
                    index = ["umsatz", "ergebnis", "börsenwert", "mitarbeiter"]).transpose()

In [16]:
data.index

Index(['airbus', 'boeing'], dtype='object')

In [17]:
data.rename(index = {"airbus":"Airbus", "boeing":"Boeing"})

        umsatz  ergebnis  börsenwert  mitarbeiter
Airbus    59.0       5.2       101.0     134267.0
Boeing    66.0      -3.5       114.0     156000.0

In [18]:
data2 = pd.DataFrame(data = {"airbus" : [59, 5.2, 101, 134267], 
                    "boeing" : [66, -3.5, 114, 156000]}, 
                    index = ["umsatz", "ergebnis", "börsenwert", "mitarbeiter"])

In [19]:
data2.index

Index(['umsatz', 'ergebnis', 'börsenwert', 'mitarbeiter'], dtype='object')

In [21]:
data2.rename(index = {"umsatz":"Umsatz", "ergebnis":"Ergebnis", 
                     "börsenwert":"Marktkapitalisierung", "mitarbeiter":"Mitarbeiter"})

                        airbus    boeing
Umsatz                    59.0      66.0
Ergebnis                   5.2      -3.5
Marktkapitalisierung     101.0     114.0
Mitarbeiter           134267.0  156000.0